'use strict'
// const reg3 = /(屌|屄|爱液|按摩棒|拔出来|爆草|包二奶|暴干|暴奸|暴乳|爆乳|暴淫|被操|被插|被干|逼奸|仓井空|插暴|操逼|操黑|操烂|肏你|肏死|操死|操我|厕奴|插比|插b|插逼|插进|插你|插我|插阴|潮吹|潮喷|成人电影|成人论坛|成人色情|成人网站|成人文学|成人小说|艳情小说|成人游戏|吃精|抽插|春药|大波|大力抽送|大乳|荡妇|荡女|盗撮|发浪|放尿|肥逼|粉穴|风月大陆|干死你|干穴|肛交|肛门|龟头|裹本|国产av|好嫩|豪乳|黑逼|后庭|后穴|虎骑|换妻俱乐部|黄片|几吧|鸡吧|鸡巴|鸡奸|妓女|奸情|叫床|脚交|精液|就去日|菊花洞|菊门|巨奶|巨乳|菊穴|开苞|口爆|口活|口交|口射|口淫|裤袜|狂操|狂插|浪逼|浪妇|浪叫|浪女|狼友|聊性|凌辱|漏乳|露b|乱交|乱伦|轮暴|轮操|轮奸|裸陪|买春|美逼|美少妇|美乳|美腿|美穴|美幼|秘唇|迷奸|密穴|蜜穴|蜜液|摸奶|摸胸|母奸|奈美|奶子|男奴|内射|嫩逼|嫩女|嫩穴|捏弄|女优|炮友|砲友|喷精|屁眼|前凸后翘|强jian|强暴|强奸处女|情趣用品|情色|拳交|全裸|群交|人妻|人兽|日逼|日烂|肉棒|肉逼|肉唇|肉洞|肉缝|肉棍|肉茎|肉具|揉乳|肉穴|肉欲|乳爆|乳房|乳沟|乳交|乳头|骚逼|骚比|骚女|骚水|骚穴|色逼|色界|色猫|色盟|色情网站|色区|色色|色诱|色欲|色b|少年阿宾|射爽|射颜|食精|释欲|兽奸|兽交|手淫|兽欲|熟妇|熟母|熟女|爽片|双臀|死逼|丝袜|丝诱|松岛枫|酥痒|汤加丽|套弄|体奸|体位|舔脚|舔阴|调教|偷欢|推油|脱内裤|文做|舞女|无修正|吸精|夏川纯|相奸|小逼|校鸡|小穴|小xue|性感妖娆|性感诱惑|性虎|性饥渴|性技巧|性交|性奴|性虐|性息|性欲|胸推|穴口|穴图|亚情|颜射|阳具|杨思敏|要射了|夜勤病栋|一本道|一夜欢|一夜情|一ye情|阴部|淫虫|阴唇|淫荡|阴道|淫电影|阴阜|淫妇|淫河|阴核|阴户|淫贱|淫叫|淫教师|阴茎|阴精|淫浪|淫媚|淫糜|淫魔|淫母|淫女|淫虐|淫妻|淫情|淫色|淫声浪语|淫兽学园|淫书|淫术炼金士|淫水|淫娃|淫威|淫亵|淫样|淫液|淫照|阴b|应召|幼交|欲火|欲女|玉乳|玉穴|援交|原味内衣|援助交际|招鸡|招妓|抓胸|自慰|作爱|a片|fuck|gay片|g点|h动画|h动漫|失身粉|淫荡自慰器|痴女|肉便器|泄欲|发泄)/g

// const reg2 = /(阴核|阴户|阴茎|阴蒂|阴部|操死|操我|厕奴|抽插|插比|插b|插逼|插进|插你|插我|插阴|被操|被插|被干|射精|射了|射爆|菊花|屄|屌|奸|淫|穴|肏|肛|骚|乳交|乳房|胸部|尿|屎|逼|奶子|摸胸|摸奶|爱液|肉棒|吃精|吞精|龟头|后庭|叫床|足交|脚交|精液|口爆|口活|口交|凌辱|露b|滥交|乱交|乱伦|轮暴|轮操|蜜液|捏弄|炮友|砲友|喷精|屁眼|强暴|情色|拳交|全裸|群交|人妻|人兽|色情|食精|兽交|爽片|酥痒|套弄|体位|调教|吸精|饥渴|性交|性奴|性虐|性欲|阳具|做爱|作爱|自慰|痴女|碧池|jj|jb|鸡鸡|鸡巴|鸡吧|肉便器|rbq|泄欲|发泄)/g

// const reg1 = /(|菊花|屄|屌|奸|淫|穴|肏|肛|骚|乳|干|操|草|艹|插|射|尿|屎|逼|奶|阴|浪|荡|日|舔|爱液|肉棒|吃精|吞精|龟头|av|后庭|黄片|叫床|足交|脚交|精液|口爆|口活|口交|凌辱|露b|滥交|乱交|乱伦|轮暴|轮操|蜜液|捏弄|炮友|砲友|喷精|屁眼|强暴|情色|拳交|全裸|群交|人妻|人兽|色情|食精|兽交|爽片|酥痒|套弄|体位|调教|吸精|饥渴|性交|性奴|性虐|性欲|阳具|做爱|作爱|自慰|痴女|jj|jb|鸡鸡|鸡巴|鸡吧|肉便器|rbq|泄欲|发泄|勃起|高潮|潮吹|潮喷|你妈)/g

const reg0 = /(屄|屌|奸|淫|穴|肏|肛|骚|逼|妓|艹|子宫|月经|危险期|安全期|戴套|无套|内射|中出|射在里|射在外|精子|卵子|受精|幼女|嫩幼|粉嫩|萝莉|日我|草我|干我|日死|草死|干死|狂日|狂草|狂干|日比|草比|搞我|舔我|舔阴|浪女|浪货|浪逼|浪妇|发浪|浪叫|淫荡|荡妇|荡女|荡货|操烂|抽插|被干|被草|被操|被日|被上|被艹|被插|被射|射爆|射了|颜射|射脸|按摩棒|肉穴|小穴|阴核|阴户|阴阜|阴蒂|阴囊|阴部|阴道|阴唇|阴茎|肉棒|阳具|龟头|勃起|爱液|蜜液|精液|食精|咽精|吃精|吸精|吞精|喷精|射精|遗精|梦遗|深喉|人兽|兽交|滥交|拳交|乱交|群交|肛交|足交|脚交|口爆|口活|口交|乳交|乳房|乳头|乳沟|巨乳|玉乳|豪乳|暴乳|爆乳|乳爆|乳首|乳罩|奶子|奶罩|摸奶|胸罩|摸胸|胸部|胸推|推油|大保健|av|黄片|爽片|a片|野战|叫床|露出|露b|乱伦|轮奸|轮暴|轮操|强奸|强暴|情色|色情|全裸|裸体|果体|酥痒|捏弄|套弄|体位|骑乘|后入|二穴|三穴|嬲|调教|凌辱|饥渴|好想要|性交|性奴|性虐|性欲|性行为|性爱|做爱|作爱|手淫|撸管|自慰|痴女|jj|jb|鸡鸡|鸡巴|鸡吧|肉便器|rbq|泄欲|发泄|高潮|潮吹|潮喷|爽死|爽翻|爽爆|你妈|屁眼|后庭|菊花|援交|操死|插死)/ig

module.exports = reg0

// let test = '我123拔出来456拔出来789爱液'
// test = test.replace(module.exports, '**')
// console.log(test)
